results-n1-standard-4-20-second-tests/1600-cache-summary.txt

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: -
     script: har-test-script.js

    duration: -, iterations: -
         vus: 1, max: 1600

    init [----------------------------------------------------------] starting
    █ page_1 - https://test.devopsdirective.com/posts/2020/03/always-on-minikube/

      ✓ content is present
      ✓ http2 is used
      ✓ status is 200

    check_failure_rate.........: 0.00%   ✓ 0      ✗ 3794  
    checks.....................: 100.00% ✓ 11433  ✗ 0     
    data_received..............: 1.7 GB  82 MB/s
    data_sent..................: 9.0 MB  421 kB/s
    group_duration.............: avg=2.62s    min=159.67ms med=2.4s     max=8.18s    p(90)=5.32s    p(95)=6.11s   
    http_req_blocked...........: avg=13.99ms  min=146ns    med=336ns    max=2.68s    p(90)=558ns    p(95)=706ns   
    http_req_connecting........: avg=8.25ms   min=0s       med=0s       max=2.37s    p(90)=0s       p(95)=0s      
    http_req_duration..........: avg=500.67ms min=12.61ms  med=359.18ms max=4.07s    p(90)=1.08s    p(95)=1.51s   
    http_req_receiving.........: avg=112.16ms min=49.58µs  med=26.71ms  max=3.52s    p(90)=321.25ms p(95)=513.22ms
    http_req_sending...........: avg=69.38µs  min=11.15µs  med=42.5µs   max=949.28ms p(90)=70.13µs  p(95)=83.42µs 
    http_req_tls_handshaking...: avg=5.71ms   min=0s       med=0s       max=1.85s    p(90)=0s       p(95)=0s      
    http_req_waiting...........: avg=388.43ms min=12.42ms  med=252.14ms max=3.9s     p(90)=909.02ms p(95)=1.25s   
    http_reqs..................: 49709   2330.673819/s
    iteration_duration.........: avg=2.73s    min=159.73ms med=2.56s    max=8.53s    p(90)=5.46s    p(95)=6.2s    
    iterations.................: 3584    168.040696/s
    vus........................: 1536    min=80   max=1536
    vus_max....................: 1600    min=1600 max=1600